; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-94)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 - object)
 (:init 
    (arm-empty)
    (clear b24)
    (on b24 b5)
    (on b5 b9)
    (on b9 b2)
    (on b2 b16)
    (on b16 b25)
    (on b25 b4)
    (on b4 b8)
    (on b8 b15)
    (on b15 b28)
    (on b28 b27)
    (on b27 b18)
    (on b18 b12)
    (on-table b12)
    (clear b26)
    (on b26 b1)
    (on b1 b14)
    (on b14 b22)
    (on b22 b10)
    (on b10 b11)
    (on b11 b23)
    (on b23 b17)
    (on-table b17)
    (clear b20)
    (on b20 b6)
    (on b6 b21)
    (on-table b21)
    (clear b13)
    (on b13 b19)
    (on b19 b7)
    (on b7 b3)
    (on-table b3))
 (:goal (and 
(on-table b1)
(on-table b2)
))
)

; plan
1. (unstack b26 b1)
   deleted: (on b26 b1) (clear b26) (arm-empty)
   added: (holding b26) (clear b1)
   goals met: 0 of 2
2. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 2
3. (unstack b1 b14)
   deleted: (on b1 b14) (clear b1) (arm-empty)
   added: (holding b1) (clear b14)
   goals met: 0 of 2
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 2
5. (unstack b24 b5)
   deleted: (on b24 b5) (clear b24) (arm-empty)
   added: (holding b24) (clear b5)
   goals met: 1 of 2
6. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 2
7. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 1 of 2
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 2
9. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 1 of 2
10. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
11. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 1 of 2
12. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 2
